---
kind: property
id: P:Autodesk.Revit.DB.HermiteSpline.IsPeriodic
source: html/1229f86d-ebdb-2c2d-9089-c2e1c8d26e15.htm
---
# Autodesk.Revit.DB.HermiteSpline.IsPeriodic Property

Returns whether the Hermite spline is periodic or not.

## Syntax (C#)
```csharp
public bool IsPeriodic { get; }
```